# The pandas library

written on above numpy library 

instead of array it creates a series

index values in series can be changed from 0,1,2,3..... to anything like a,b,c,d.... etc 

series represent data more systematically in something of a tabular format

In [158]:
import numpy as np

In [159]:
import pandas as pd

In [160]:
lis=['a','b','c']

In [161]:
my_data=[1,2,3]

In [162]:
d={'a':1,'b':2,'c':3}

In [163]:
arr=np.array(my_data)

In [164]:
pd.Series(data=my_data, index=lis)

a    1
b    2
c    3
dtype: int64

observe how pandas created a series which has indexing as a,b,c for data 1,2,3

In [165]:
pd.Series(my_data,lis)
# we dont need to mention the data and index name specifically

a    1
b    2
c    3
dtype: int64

### We can pass lists, arrays, dictionaries to create a series

In [166]:
pd.Series(data=arr,index=lis)
# passing an array as data and a list as index

a    1
b    2
c    3
dtype: int32

##### We can pass a whole dictioary in a series and it will be taken up as

keys: indexing 

values: data

In [167]:
pd.Series(d)

a    1
b    2
c    3
dtype: int64

# Series can hold any data types as data even fucntion!!!!
# this makes series quite flexible

In [11]:
ser21=pd.Series([1,2,3,4],['Red Bull','Mercs','Ferrari','Alpine'])

In [12]:
ser21

Red Bull    1
Mercs       2
Ferrari     3
Alpine      4
dtype: int64

In [13]:
ser22=pd.Series([1,2,3,4],['Red Bull','Mercs','Ferrari','Mclaren'])

In [14]:
ser22

Red Bull    1
Mercs       2
Ferrari     3
Mclaren     4
dtype: int64

In [15]:
ser22['Ferrari'] +ser21['Red Bull']

4

In [16]:
ser21

Red Bull    1
Mercs       2
Ferrari     3
Alpine      4
dtype: int64

In [17]:
ser22

Red Bull    1
Mercs       2
Ferrari     3
Mclaren     4
dtype: int64

In [18]:
ser21 + ser22
# note that the resultant data is in float value this happens so that any calulation change in result are highlighted

Alpine      NaN
Ferrari     6.0
Mclaren     NaN
Mercs       4.0
Red Bull    2.0
dtype: float64

## when we  2 series they are ed on the basis of their index and if the index value and type of both the series is not same[in case of Mclaren and Alpine] we get a null value in data of resultant series

# Data frames in python 

data frames are 2D tables of data made using the numpy library

data frames are just mutiple columns( in series format) sharing a commmon index list 

syntax: pd.DataFrame( {data in matrix form},  {indexing of rows},   {indexing of columns}  )

indexing of rows of columns can use any data type just as series

In [19]:
arr1=np.arange(2,42,2).reshape(5,4)

In [20]:
arr1

array([[ 2,  4,  6,  8],
       [10, 12, 14, 16],
       [18, 20, 22, 24],
       [26, 28, 30, 32],
       [34, 36, 38, 40]])

In [21]:
dat1=pd.DataFrame(arr1,['a','b','c','d','e'],['Col_1','Col_2','Col_3','Col_4'])

In [22]:
dat1
# below is a dataframe of table of 2 which has 4 columns and all columns have row indexing as a,b,c,d

   Col_1  Col_2  Col_3  Col_4
a      2      4      6      8
b     10     12     14     16
c     18     20     22     24
d     26     28     30     32
e     34     36     38     40

### how to acces a single column

syntax: dataframe name['column name'/column number if data type is integer]

In [23]:
dat1['Col_1']
# note that this column we obtained is a list having indexing as a,b,c,d,e

a     2
b    10
c    18
d    26
e    34
Name: Col_1, dtype: int32

In [24]:
dat1['Col_4']

a     8
b    16
c    24
d    32
e    40
Name: Col_4, dtype: int32

### how to acess mutiple columns

syntax:dataframe name [  [a list which has names of columns to be included]   ]

In [25]:
dat1[['Col_1','Col_4']]

# the group of columns that we have obtained is also a dataframe obtained from the parent data frame

   Col_1  Col_4
a      2      8
b     10     16
c     18     24
d     26     32
e     34     40

# how to access first n rows in a datafram

use the  .head() method

syntax: df_name.head(number of rows you wanna see)

syntax: df_name.head()➡️gives us all the rows in a dataframe

In [156]:
dat1.head(2)
# gives the first 2 rows

   Col_1  Col_2  Col_3  Col_4
a      2      4      6      8
b     10     12     14     16

In [157]:
dat1.head()
# gives all the rows

   Col_1  Col_2  Col_3  Col_4
a      2      4      6      8
b     10     12     14     16
c     18     20     22     24
d     26     28     30     32
e     34     36     38     40

### how to  a new column in a dataframe

using a list to  a new column 
syntax: datframe name['new column name']=[data in a list format]

In [26]:
dat1['New_Col']=["this",'is','a','new','column']

In [27]:
dat1

   Col_1  Col_2  Col_3  Col_4 New_Col
a      2      4      6      8    this
b     10     12     14     16      is
c     18     20     22     24       a
d     26     28     30     32     new
e     34     36     38     40  column

2. using the insert function
 datframe name.insert( index of column,  name of column, [data in list format], True/False)
 
 true: to allow copying the list somewhere else in a dataframe
 
 false: to prevent copying inside the dataframe

In [28]:
dat1.insert(5,'Chandu_bhai', ['chandu','chacha','chachi', 'aur', 'chamchi'],True)

In [29]:
dat1

   Col_1  Col_2  Col_3  Col_4 New_Col Chandu_bhai
a      2      4      6      8    this      chandu
b     10     12     14     16      is      chacha
c     18     20     22     24       a      chachi
d     26     28     30     32     new         aur
e     34     36     38     40  column     chamchi

note: if we try to take name of an existing column while inserting a new column this is not possible

# NOTE: AXIS=0➡️ROWS,   AXIS=1➡️COLUMNS
because in a tuple of (rows,columns) row index=0 and column index=1

### how to remove columns from a datframe

syntax: datframe name.drop('Column name')

In [30]:
dat1

   Col_1  Col_2  Col_3  Col_4 New_Col Chandu_bhai
a      2      4      6      8    this      chandu
b     10     12     14     16      is      chacha
c     18     20     22     24       a      chachi
d     26     28     30     32     new         aur
e     34     36     38     40  column     chamchi

In [31]:
dat1.drop('Chandu_bhai', axis=1)
# inplace=True to apply the change

   Col_1  Col_2  Col_3  Col_4 New_Col
a      2      4      6      8    this
b     10     12     14     16      is
c     18     20     22     24       a
d     26     28     30     32     new
e     34     36     38     40  column

In [32]:
dat1.drop('Chandu_bhai',axis=1,inplace=True)

In [33]:
dat1.drop('New_Col',axis=1,inplace=True)

In [34]:
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    dat1

   Col_1  Col_2  Col_3  Col_4
a      2      4      6      8
b     10     12     14     16
c     18     20     22     24
d     26     28     30     32
e     34     36     38     40

### how to drop/remove rows in a datframe

In [35]:
dat1.drop('e')

   Col_1  Col_2  Col_3  Col_4
a      2      4      6      8
b     10     12     14     16
c     18     20     22     24
d     26     28     30     32

### how to grab rows from a data frame

syntax: datframe name.loc[row name]➡️locate

syntax: dataframe name.iloc[ row index number]

In [36]:
dat1

   Col_1  Col_2  Col_3  Col_4
a      2      4      6      8
b     10     12     14     16
c     18     20     22     24
d     26     28     30     32
e     34     36     38     40

In [37]:
dat1.loc['a']

Col_1    2
Col_2    4
Col_3    6
Col_4    8
Name: a, dtype: int32

In [38]:
dat1.loc['c']

Col_1    18
Col_2    20
Col_3    22
Col_4    24
Name: c, dtype: int32

In [39]:
dat1.iloc[2]

Col_1    18
Col_2    20
Col_3    22
Col_4    24
Name: c, dtype: int32

### how to grab cell and sction from rows and columns from a dataframe
syntax{ for grabbing a cell}: datframe name[row name, column name}

syntax{ for a grabbing a section} datframe name[   [a row list for horizontal region],   [ a column list for vertical region]]

In [40]:
dat1

   Col_1  Col_2  Col_3  Col_4
a      2      4      6      8
b     10     12     14     16
c     18     20     22     24
d     26     28     30     32
e     34     36     38     40

In [41]:
dat1.loc['a','Col_1']
# to grab a cell

2

In [42]:
dat1.loc['a':'d','Col_1':'Col_3']
# to grab a region

   Col_1  Col_2  Col_3
a      2      4      6
b     10     12     14
c     18     20     22
d     26     28     30

In [43]:
np.random.seed(101)

In [44]:
pd_dat=pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [45]:
pd_dat

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Conditionals in pandas
syntax: dataframe name[  condtioton]➡️this returs a new data frame where the value 'null' is shown if condition is not matched
syntax : data frame name['row/column name'] {condition}

step 1: condition applied 

step2: boolean table to true and false made

step 3: boolean table passed through the data frame||| true➡️value shown|||| false➡️null value shown

In [46]:
pd_dat[pd_dat>1]
#nan is the null value shown where the condition is false

         W         X         Y   Z
A  2.70685       NaN       NaN NaN
B      NaN       NaN       NaN NaN
C      NaN       NaN       NaN NaN
D      NaN       NaN       NaN NaN
E      NaN  1.978757  2.605967 NaN

In [47]:
pd_dat

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [48]:
pd_dat['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

when we pass a condtion with a column through the data frame we only get the resultant cell and the row/column attached to it

In [49]:
pd_dat

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
res=pd_dat[pd_dat['W']>0]
# dataframe name[column chosen:::condtion]➡️this gives out the cells in that series following that condition and the rows attached to them

In [51]:
res

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
res['Y']
# choosing a column from a resultant data frame

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

#### now all these steps

1.applying  a condtion to a data frame 

2.obtainigng a data frame

3. selecting a column from that resultant data frame 

#### all these steps can be done in a single step 

synatax: name of dt[dt name[column name]:: condition][row/column name from resultant data frame]

In [53]:
pd_dat

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
pd_dat[pd_dat['Z']>0]['Z'].loc['A':'D']

# all the steps done in a single line of code

A    0.503826
B    0.605965
D    0.955057
Name: Z, dtype: float64

In [55]:
pd_dat

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
boolser=pd_dat['Y']>0

In [57]:
res_dat=pd_dat[boolser]
# only true values are shown in the resultant data set

In [58]:
res_dat

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [59]:
LIS=['Y','X']

In [60]:
res_dat[LIS]

          Y         X
A  0.907969  0.628133
C  0.528813  0.740122
E  2.605967  1.978757

### see how we broken down the task of obtaining mutiple columns from a resultant conditional data frame into several variables

dataframe➡️condition➡️resultant data frame obtained➡️columns selected➡️resultant data frame of selected columns

In [61]:
pd_dat

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [62]:
pd_dat[pd_dat['Y']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
C  0.740122  0.528813
E  1.978757  2.605967

In [63]:
pd_dat

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [64]:
pd_dat[pd_dat['W']==pd_dat['W'].max()]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

# passing mutiple conditions into a dataset
syntax: df name[(condn 1) & (condn 2)]

and➡️{&}

or➡️{|}

In [65]:
pd_dat

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

pd_dat[(pd_dat['W']>0) and pd_dat['Y']>1]
<!--  we cannot use an and operator -->

we cannot use an and operator because it can only take 2 booleans on each side and not a series of booleans

ex: True and True

False and True

for this purpose we use the '&' operator which takes up series to apply the and apply the and fucntion on those 2

In [66]:
pd_dat[(pd_dat['W']>0) & (pd_dat['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [67]:
pd_dat['X']>1

A    False
B    False
C    False
D    False
E     True
Name: X, dtype: bool

In [68]:
pd_dat['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [69]:
pd_dat

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
pd_dat[(pd_dat['W']>2)  | (pd_dat['Y']>2)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

## how to reset the index back to 0,1,2,3.....
syntax: df name.reset_index()

this gives us a new index for column starting from 0,1,2,3....

it also makes the old  index that we have made into a an inserted series into our data set 

this change is not made into the orignal dataframe 

to do that we need to put inplace=True

In [71]:
pd_dat.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

observe the new columns named as index which contains the elements as our orignal indexing

# how to assign an existing columns as an index

syntax: df name.set_index('Column name')

this change made in indexing will be temprorary and in order to make it permanent we have to set inplace=True

In [72]:
pd_dat

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [73]:
pd_dat['Values']=['always','keep','your','morals','stiff']
# ing a new column to column

In [74]:
pd_dat

          W         X         Y         Z  Values
A  2.706850  0.628133  0.907969  0.503826  always
B  0.651118 -0.319318 -0.848077  0.605965    keep
C -2.018168  0.740122  0.528813 -0.589001    your
D  0.188695 -0.758872 -0.933237  0.955057  morals
E  0.190794  1.978757  2.605967  0.683509   stiff

In [75]:
pd_dat.set_index('Values')
# the table below is temproary

               W         X         Y         Z
Values
always  2.706850  0.628133  0.907969  0.503826
keep    0.651118 -0.319318 -0.848077  0.605965
your   -2.018168  0.740122  0.528813 -0.589001
morals  0.188695 -0.758872 -0.933237  0.955057
stiff   0.190794  1.978757  2.605967  0.683509

In [76]:
pd_dat.set_index('Values',inplace=True)

In [77]:
pd_dat

               W         X         Y         Z
Values
always  2.706850  0.628133  0.907969  0.503826
keep    0.651118 -0.319318 -0.848077  0.605965
your   -2.018168  0.740122  0.528813 -0.589001
morals  0.188695 -0.758872 -0.933237  0.955057
stiff   0.190794  1.978757  2.605967  0.683509

# Multi Index

In [78]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [79]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

# the zip function 

zip function creates a list 

this list has tuples

these tuples containes the given 2 list data in pairs

syntax: zip(list1, list2)

to keep the data into a list of tuple use the list () function along with the zip fuction

In [80]:
lis1=['a','b','c','d']
lis2=[1,2,3,4]

In [81]:
lis3=list(zip(lis1,lis2))

In [82]:
lis3

[('a', 1), ('b', 2), ('c', 3), ('d', 4)]

In [83]:
lis4= list(zip(lis3,lis2))

In [84]:
lis4

[(('a', 1), 1), (('b', 2), 2), (('c', 3), 3), (('d', 4), 4)]

# back to hierarchy indexing

In [85]:
d=pd.DataFrame(np.random.randn(6,2),hier_index,['A','B'])

In [86]:
d
# the below data frame contains hierarchy indexing in which index level are created

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

# Rule!!!!: Always go from outside to the inside➡️➡️➡️➡️➡️

In [87]:
d.loc['G1']
# this is layer 1 lets go deeper

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [88]:
d.loc['G1'].loc[1]
# here we have the 1st row of the G1 section 

# observe how it comes out in the form of a series

# lets go deeper to grab specific celle from columns

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [89]:
d.loc['G1'].loc[3]['B']

# section:G1

# row: 3

# column: B

0.39052784273374097

In [90]:
d.loc['G2'].loc[1]['A']

# section: G2
    
# row:1
    
# column: A

0.16690463609281317

# giving titles/names to indexing columns
syntax: df_name.index.name(s)=['Column name of index 1','Column name of index 2']

index 1 and 2 are index heirarchy names if there is one heirarchy present in datframe

In [91]:
d.index.names=['Sections','Embedded_rows']

In [92]:
d

                               A         B
Sections Embedded_rows
G1       1              0.302665  1.693723
         2             -1.706086 -1.159119
         3             -0.134841  0.390528
G2       1              0.166905  0.184502
         2              0.807706  0.072960
         3              0.638787  0.329646

# how to acess rows from both the sections at once

# we use the xs function 

# this function lets us grap rows from multiple sections at once

syntax: df_name.xs(indexing name/number of the common row,                   level=name of the column which has the common rows in it)

In [93]:
d.xs(3,level='Embedded_rows')
# index of common rows

# level= name of the section of common rows

                 A         B
Sections
G1       -0.134841  0.390528
G2        0.638787  0.329646

# missing data in a dataframe

what is missing data: they are chunks of cell who're null or have a null value

In [94]:
mis = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [95]:
mis

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [96]:
# the nan cells are the ones with the missing data

### how to altogether remove the rows and columns with missing data cells
use the .dropna function 

df_name.dropna()➡️to remove all the rows with missing data

df_name.dropna(axis=1)➡️ to  remove all the columns with missing data

## how to set a filter to drop the missign data cells

a filter sets the minimum amount of filled data cells required to keep that particluar row or a column in the data frame

syntax: df_name.dropna(thresh=2)
    
    thresh = 2➡️ means that it requires minimum 2 data cells to keep the particlar row

In [97]:
mis

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [98]:
mis.dropna(thresh=2, axis=0)
# keep those rows which have minimum 2 filled data cells

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

# how to fill these null cells
use the fillna() method 

this fills all the cells at once if not mentioned the particular row or column

syntax: df_name.fillna(value='the value you wanna  fill it with')

syntax: {row/column picked up}.fillna(value='the value you wanna  fill it with')➡️to fill data into a particular row/column

In [99]:
mis.fillna(value='fill value')
# see how each empty cell gets the same value

            A           B  C
0         1.0         5.0  1
1         2.0  fill value  2
2  fill value  fill value  3

In [100]:
mis.fillna(value=mis['A'].mean())
# the mean of the first row is filled as the missing value

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [101]:
mis['B'].fillna(value='ColB',inplace=True)
# to fill data into  particular row/column

In [102]:
mis

     A     B  C
0  1.0   5.0  1
1  2.0  ColB  2
2  NaN  ColB  3

# using the groupby method 
it allows the user to group several rows into a single row 

this single row creates is created by applying a matehematical fucntion to all the rows

like result row is sum of all the created rows

In [103]:
# creating a data frame
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [104]:
df=pd.DataFrame(data)

# the groupby function groups cells in a column if they're same 

# then it can be used to sum kind of maths on it 

# like ing the grouped elements or taking  their mean etc.

In [105]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [106]:
res=df.groupby('Company')
# grouping on a column return the object 

# now this obeject needs to be stored somewhere

In [107]:
res.sum()
# now we'll apply a mathematical function on this object

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [108]:
# applying a maths method gives us a reusltant dataframe

In [109]:
res.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [110]:
# we can do all of this code in just one line and we do not have to create a variable every time

In [111]:
df.groupby('Company').sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [112]:
df.groupby('Company').sum().loc['FB']
# we can also select columns from the resultant data frame

Sales    593
Name: FB, dtype: int64

In [113]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [114]:
df.groupby('Company').mean().loc['GOOG']

Sales    160.0
Name: GOOG, dtype: float64

In [115]:
 df.groupby('Company').count()
# the count function gives us data about how many times something occurs

# like FB data entry occurs 2 times inside our data frame

# this time the person column was also shown because the data occurence in FB column can be counted in the person column

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

## how to get all the info about the grouped columns using group by method

use the describe() function 

syntax:df_name.groupby('Grouping column').desribe()➡️for vertical format

syntax:df_name.groupby('Grouping column').desribe().transpose()➡️for horizontal format

In [116]:
df.groupby('Company').describe()
# in vertical format

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [117]:
df.groupby('Company').describe().transpose()
# with grouping rows as a column

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

# Merging, joining and concatenation of data frames

# 1. concatenation

it is gluing 2 data frames together 

either one on top of each other[ i.e along rows]

one by the side of the other[i.e along columns]➡️use axis = 1 here


syntax[along rows]: pd.concat( [ a list wiith names of dataframes to  concatenate] )

syntax{ along column]: pd.concat( [list of data frame to concatente], axis=1  )

In [118]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [119]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [120]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [121]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [122]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [123]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [124]:
pd.concat([df1,df2,df3])
# one on top of each other
# this is along rows

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [125]:
pd.concat([df1,df2,df3],axis=1)
# one on the side of each other
# this is along rows

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# NOTE!!!!: dimension should match for concatenation because it is done according to the index number

# Merging data frames

it is joining 2 data frames accoring to a common rows

these common rows are not repeated

syntax: pd.merge(df_1,df_2, how='inner, on='name of common row')

column to put for [on] must be found in both the dataframes

In [126]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [127]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

# operations

In [128]:
df=pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [129]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [130]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# getting a list of unique values in a column

In [131]:
df['col2'].unique()
# all the unique values

array([444, 555, 666], dtype=int64)

In [132]:
df['col2'].nunique()
# gives the number of unique values

3

In [133]:
df['col2'].value_counts()
# gives the number of times each unique value is repeated

444    2
555    1
666    1
Name: col2, dtype: int64

# Applying our own custom made functions to the elements in a columns of a dataframe

df_name['Column name to apply function on'].apply(custom function name)

In [134]:
def double(x):
    return x*2

In [135]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [136]:
df['col1'].apply(double)
# we applied our double function on column 1 in our data frame

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [137]:
df['col1'].apply(lambda x:x**2)
# usign the labda function directly

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

## How to permanently delete a column
 syntax: del df_name['Column name']

In [138]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [139]:
df['col4']=[1,2,4,5]

In [140]:
df

   col1  col2 col3  col4
0     1   444  abc     1
1     2   555  def     2
2     3   666  ghi     4
3     4   444  xyz     5

In [141]:
del df['col4']
# permanent delete

In [142]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# how to get info about columns and rows in a data frame

syntax: 

{for columns names}: df_name.columns➡️gives a value in form of list

{for rows/indexing}: df_name.index➡️gives a value in start  and stop

In [143]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [144]:
df.index

RangeIndex(start=0, stop=4, step=1)

# how to sort values in a dataframe

df_name.sort_values('name of the column')

In [145]:
df.sort_values('col2')
# combines the values which are repeating

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

# how to check for null values in a data frame

df.isnull()➡️gives a dataframe with trueo or false

false: there is value in this cell

true: null value

In [146]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# Handling data files

# 1.CSV files

reading a csv file: pd.read_csv('file name')


writing to a file:

first save the file as a data frame

df_name.to_csv('name of the change')

to see this change you gotta do the read_Csv thing again

In [147]:
import pandas as pd

In [148]:
t=pd.read_csv('example')

In [149]:
t.to_csv('mychange')

In [150]:
pd.read_csv('example')
# this condition is index=True where row number are represented as the first column

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [151]:
# you gotta make index= False to prevent that from happening from making index as the first column what else dumbhead

# 2. Excel files

In [152]:
conda install xlsx

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... failed with initial frozen solve. Retrying with flexible solve.
Collecting package metadata (repodata.json): ...working... done
Solving environment: ...working... failed with initial frozen solve. Retrying with flexible solve.

Note: you may need to restart the kernel to use updated packages.

PackagesNotFoundError: The following packages are not available from current channels:

  - xlsx

Current channels:

  - https://repo.anaconda.com/pkgs/main/win-64
  - https://repo.anaconda.com/pkgs/main/noarch
  - https://repo.anaconda.com/pkgs/r/win-64
  - https://repo.anaconda.com/pkgs/r/noarch
  - https://repo.anaconda.com/pkgs/msys2/win-64
  - https://repo.anaconda.com/pkgs/msys2/noarch

To search for alternate channels that may provide the conda package you're
looking for, navigate to

    https://anaconda.org

and use the search bar at the top of the page.

In [153]:
# reading an excel file
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheetname')

TypeError: read_excel() got an unexpected keyword argument 'sheetname'

In [ ]:
pd.read_excel('Excel_Sample.xlsx',sheet_name="Sheet1")

In [ ]:
conda install lxml

In [ ]:
conda install html5lib

In [ ]:
conda install BeautifulSoup4

In [ ]:
conda install -c conda-forge/label/cf202003 r-openxlsx

In [ ]:
data=pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [ ]:
data[0]